Repository: Mermouy/ST_video_tuto_sub
Catalog: video1/video1-*.po
Languages: fr_fr

source: Serpents Tongue Tutorial video
fr_fr: Serpent's Tongue Tutoriel Vidéo

source: Welcome to the world of Serpent's Tongue,
fr_fr: Bienvenue dans le monde de Serpent's Tongue

source: In Serpents Tongue, players will take on the roles of Magis
fr_fr: Dans Serpent's Tongue, les joueurs incarnent des Magis

source: and seek to expand their power and their influence.
fr_fr: et essaieront d'étendre leur pouvoir et leur influence.

source: Now you have a role in the modern times,
fr_fr: Vous avez maintenant un rôle à tenir dans ces temps nouveaux,

source: filled with the memory of campus lives of Magis!
fr_fr: secondé par les mémoires de vies entières de Magis!

source: But be warned, the world of Magis is a dangerous one,
fr_fr: Mais prenez garde, le monde des Magis peut-être dangereux,

source: and attempting to asserve or destroy you.
fr_fr: et essaieront peut-être de vous asservir ou de vous détruire.

source: Serpent's Tongue is a spellcasting simulation game,
fr_fr: Serpent's Tongue est un jeu de simulation magique,

source: that can be played solo or up to eight players.
fr_fr: qui peut-être joué seul ou jusqu'à 8 joueurs.

source: It has both player versus player as well as cooperative modes.
fr_fr: Il Comprend des modes coopératifs ou joueur contre joueur.

source: It can be played with nothing more than the core set,
fr_fr: Le set de base suffit pour commencer à jouer,

source: which contains everything you need for two players.
fr_fr: il contient tout ce qu'il faut pour 2 joueurs.

source: It contains 108 giant spell cards, artifacts and specialization cards.
fr_fr: Il contient 108 cartes géantes de sorts, d'artefacts et de spécialisations,

source: Two leather spellbooks, energy trackers, focus gems and more.
fr_fr: deux grimoires de cuir, des compteurs d'énergie, une gemme de concentration et plus encore.

source: As a Magi you'll construct the spellbook or the codex,
fr_fr: En tant que Magi vous devrez concevoir votre grimoire ou Codex,

source: filling it with 27 spells
fr_fr: en y incluant 27 sorts

source: that you will have to master in order to cast.
fr_fr: que vous devrez maîtriser avant de lancer.

source: Each spell has an activation phrase,
fr_fr: Chaque sort est lié à une phrase d'activation,

source: written in a fully fonctionning language of Magick,
fr_fr: écrite dans un langage magique fonctionnel,

source: that must be memorized or decoded on the fly
fr_fr: qui doit être mémorisé ou décodé au passage

source: in order for to be played.
fr_fr: pour être joué.

source: In addition you will choose a specialization which will focus your abilities
fr_fr: Vous choisirez également une Spécialisation qui optimisera vos compétences

source: and create synergies whithin your spellbook.
fr_fr: et créera une véritable synergie au sein de votre grimoire.

source: Also, each Magi carrys one powerful artefact,
fr_fr: De plus chaque Magi possède un artefact puissant,

source: which provides a wild range of advantages.
fr_fr: qui procure une vaste variété d'avantages.

source: Your specialization, your artefact and your 27 spells codex,
fr_fr: Votre spécialisation, votre artefact et les 27 sorts de votre Codex,

source: will make up your persona as a Magi
fr_fr: définiront votre propre Magi

source: and dertermine your range of strategies.
fr_fr: et détermineront vos possibilités de stratégies.

source: As a Magi you will participate in magical combats,
fr_fr: En tant que Magi vous participerez aux combats magiques,

source: where the objective is to destroy your opponents.
fr_fr: où l'objectif est de détruire vos adversaires;

source: As well experience storybased adventure campaigns,
fr_fr: tout comme que de véritables campagnes d'aventures contées,

source: released seperatly from the core set.
fr_fr: qui sortiront séparément du set de base.
